package prizedrowtelegrambot.enums;

public enum BotMessageEnum {

    INTRO_MESSAGE("""
            Вітаємо тебе, друже, на розіграші баски від Марії Кулієвої!
                                   
            Декілька простих кроків і ти матимеш свої квитки, а тобто шанси
            на виграш. Нагадаємо, що 1 квиток коштує 250 грн, але ти
            можеш придбати скільки забажаєш. Усі отримані гроші,
            окрім 8000 грн на зарплатню та матеріали, ми відправляємо
            Волонтерському угрупуванню від бару “Світч”, яке збирає
            на дрон для захисників. Тому навіть якщо тобі не пощастить
            виграти сексі баску, ти все одно допоможеш країні та
            підтримаєш молоде відчизняне виробництво.
            """),
    TICKETS_AMOUNT_MESSAGE("Напиши кількість квитків, які плануєш придбати (лише цифру)"),

    PAYMENT_MESSAGE("""
            Дякую за твою участь!
            "Перекажи будь-ласка суму %d на картку 4441114457745725
            """),
    AFTER_PAYMENT_MESSAGE("Дякуємо за твою оплату! Адмін підтвердить твій запит протягом 24 годин максимум."),
    NON_COMMAND_MESSAGE("Невідома команда або невірний формат ввода суми: повиинні бути лише цифри"),
    EXCEPTION_WHAT_THE_FUCK("Something went wrong"),
    SAME_PAYMENT_EXIST("Ви вже робили внесок на таку саме сумму");

    private final String message;

    BotMessageEnum(String message) {
        this.message = message;
    }

    public String getMessage() {
        return message;
    }
}
